Autodesk.Revit.DB.Structure.LoadNatureCategory
Since:
2016
Specifies load case nature.
Since:
2016

Autodesk.Revit.DB.Structure.LoadNatureCategory.Seismic
Seismic

Autodesk.Revit.DB.Structure.LoadNatureCategory.Temperature
Temperature

Autodesk.Revit.DB.Structure.LoadNatureCategory.Accidental
Accidental

Autodesk.Revit.DB.Structure.LoadNatureCategory.RoofLive
Roof Live

Autodesk.Revit.DB.Structure.LoadNatureCategory.Snow
Snow

Autodesk.Revit.DB.Structure.LoadNatureCategory.Wind
Wind

Autodesk.Revit.DB.Structure.LoadNatureCategory.Live
Live

Autodesk.Revit.DB.Structure.LoadNatureCategory.Dead
Dead